#include <stdio.h>

int main(void)
{
	printf("%5d\n", 10); // 출력될 때 5자리로 맞춰줌
	printf("%5d\n", 100);
	printf("%05d\n", 1000); // 출력될 때 5자리로 맞춰주고 빈자리를 0으로 채워줌
	printf("%05d\n", 10000);

	printf("---------------------------------------------\n");

	printf("%b\n", 100);  //  2진수 출력
	printf("%o\n", 100);  //  8진수 출력
	printf("%x\n", 100);  // 16진수 출력

	printf("---------------------------------------------\n");

	printf("%lf\n", 3.4);		// %lf 위치에 3.4 출력
	printf("%.1lf\n", 3.45);	// 
	printf("%.10lf\n", 3.4);	//

	printf("---------------------------------------------\n");

	printf("%11lf\n", 3.7);		// %lf 위치에 3.4 출력
	printf("%6.1lf\n", 3.85);	// 
	printf("%15.10lf\n", 3.67);	//

	printf("---------------------------------------------\n");

	printf("%d과 %d의 합은 %d입니다.\n", 10, 20, 10 + 20);
	printf("%.1lf-%.1lf = %.1lf\n", 3.4, 1.2, 3.4 - 1.2);

	return 0;
}
